## Some ETL Related Tests

In [22]:
import pandas as pd

In [40]:
from functools import reduce

In [16]:
import os

### Load Files

In [26]:
workdir = '/tmp/rideindego'
data_files = os.listdir(workdir)

In [29]:
csv_files = [os.path.join(workdir,i) for i in data_files if i.endswith('.csv')]

In [30]:
csv_files

['/tmp/rideindego/indego-trips-2018-q4.csv',
 '/tmp/rideindego/Q3_2016_trips.csv',
 '/tmp/rideindego/indego-trips-2018-q3.csv',
 '/tmp/rideindego/indego-trips-2018-q2.csv',
 '/tmp/rideindego/indego-trips-2018-q1.csv',
 '/tmp/rideindego/indego-quarter-echo.bicycletransit.com-2018-01-19-9-57 AM.csv',
 '/tmp/rideindego/indego_gbfs_trips_Q1_2017.csv',
 '/tmp/rideindego/Indego_trips_Q4_2016.csv',
 '/tmp/rideindego/indego-trips-2017-q3.csv',
 '/tmp/rideindego/indego-trips-2019-q1.csv',
 '/tmp/rideindego/Indego_Trips_2016Q1.csv',
 '/tmp/rideindego/Indego_Trips_2016Q2.csv',
 '/tmp/rideindego/indego_gbfs_trips_Q2_2017.csv',
 '/tmp/rideindego/Indego_Trips_2015Q4.csv',
 '/tmp/rideindego/Indego_Trips_2015Q3.csv',
 '/tmp/rideindego/Indego_Trips_2015Q2.csv']

In [31]:
df_all = pd.DataFrame()

In [33]:
df_array = [pd.read_csv(csv_file) for csv_file in csv_files]

/Users/leima/anaconda/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2850: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  if self.run_code(code, result):

Validate imported data

In [64]:
for i in df_array:
    print('columns:', len(i.columns), '; index:', i.index, '; length:', len(i))

columns: 15 ; index: RangeIndex(start=0, stop=142872, step=1) ; length: 142872
columns: 14 ; index: RangeIndex(start=0, stop=234946, step=1) ; length: 234946
columns: 15 ; index: RangeIndex(start=0, stop=228329, step=1) ; length: 228329
columns: 14 ; index: RangeIndex(start=0, stop=201624, step=1) ; length: 201624
columns: 14 ; index: RangeIndex(start=0, stop=98993, step=1) ; length: 98993
columns: 14 ; index: RangeIndex(start=0, stop=183909, step=1) ; length: 183909
columns: 14 ; index: RangeIndex(start=0, stop=107772, step=1) ; length: 107772
columns: 14 ; index: RangeIndex(start=0, stop=176119, step=1) ; length: 176119
columns: 14 ; index: RangeIndex(start=0, stop=276785, step=1) ; length: 276785
columns: 15 ; index: RangeIndex(start=0, stop=96593, step=1) ; length: 96593
columns: 14 ; index: RangeIndex(start=0, stop=73169, step=1) ; length: 73169
columns: 14 ; index: RangeIndex(start=0, stop=170824, step=1) ; length: 170824
columns: 14 ; index: RangeIndex(start=0, stop=220441, step=1) ; length: 220441
columns: 14 ; index: RangeIndex(start=0, stop=121783, step=1) ; length: 121783
columns: 14 ; index: RangeIndex(start=0, stop=188368, step=1) ; length: 188368
columns: 14 ; index: RangeIndex(start=0, stop=119559, step=1) ; length: 119559

In [65]:
df_array[0].columns

Index(['trip_id', 'duration', 'start_time', 'end_time', 'start_station',
       'start_lat', 'start_lon', 'end_station', 'end_lat', 'end_lon',
       'bike_id', 'plan_duration', 'trip_route_category', 'passholder_type',
       'bike_type'],
      dtype='object')

In [66]:
df_array[1].columns

Index(['trip_id', 'duration', 'start_time', 'end_time', 'start_station_id',
       'start_lat', 'start_lon', 'end_station_id', 'end_lat', 'end_lon',
       'bike_id', 'plan_duration', 'trip_route_category', 'passholder_type'],
      dtype='object')

In [70]:
df_array[0].head(2)

,trip_id,duration,start_time,end_time,start_station,start_lat,start_lon,end_station,end_lat,end_lon,bike_id,plan_duration,trip_route_category,passholder_type,bike_type
0,299955254,30,2018-10-01 00:03:00,2018-10-01 00:33:00,3038,39.947811,-75.194092,3063,39.947811,-75.194092,11908,30,One Way,Indego30,standard
1,299955253,7,2018-10-01 00:06:00,2018-10-01 00:13:00,3032,39.945271,-75.179710,3064,39.945271,-75.179710,5382,30,One Way,Indego30,standard

In [71]:
df_array[1].head(2)

,trip_id,duration,start_time,end_time,start_station_id,start_lat,start_lon,end_station_id,end_lat,end_lon,bike_id,plan_duration,trip_route_category,passholder_type
0,25183529,240,7/1/2016 0:07,7/1/2016 0:11,3063,39.946331,-75.1698,3064,39.9384,-75.173271,3640,30,One Way,Indego30
1,25183528,480,7/1/2016 0:10,7/1/2016 0:18,3124,39.95295,-75.139793,3026,39.94138,-75.145638,3349,30,One Way,Indego30

In [72]:
df_array[2].head(2)

,trip_id,duration,start_time,end_time,start_station,start_lat,start_lon,end_station,end_lat,end_lon,bike_id,plan_duration,trip_route_category,passholder_type,bike_type
0,276039688,17,2018-07-01 00:03:00,2018-07-01 00:20:00,3007,39.945171,-75.159927,3073,39.945171,-75.159927,11913,30,One Way,Indego30,standard
1,276039689,17,2018-07-01 00:03:00,2018-07-01 00:20:00,3007,39.945171,-75.159927,3073,39.945171,-75.159927,3284,30,One Way,Indego30,standard

### Check Data Quality

In [46]:
df_all = pd.concat(df_array)

In [48]:
df_all.describe()

,duration,end_station,end_station_id,plan_duration,start_station,start_station_id,trip_id
count,2.642086e+06,1.449546e+06,1.192540e+06,2.642086e+06,1.449546e+06,1.192530e+06,2.642086e+06
mean,6.622166e+02,3.221512e+03,3.043533e+03,4.487516e+01,3.065516e+03,3.044298e+03,1.371636e+08
std,2.925911e+03,3.702522e+03,2.886743e+01,8.046680e+01,3.100064e+02,2.887558e+01,1.109280e+08
min,1.000000e+00,3.000000e+03,3.000000e+03,0.000000e+00,3.000000e+03,3.000000e+03,4.001912e+06
25%,1.100000e+01,3.025000e+03,3.022000e+03,3.000000e+01,3.026000e+03,3.022000e+03,4.812222e+06
50%,3.700000e+01,3.053000e+03,3.038000e+03,3.000000e+01,3.054000e+03,3.039000e+03,1.292478e+08
75%,6.600000e+02,3.099000e+03,3.061000e+03,3.000000e+01,3.100000e+03,3.061000e+03,2.431956e+08
max,8.640000e+04,9.025500e+04,3.129000e+03,3.650000e+02,9.001800e+04,3.129000e+03,3.133633e+08

In [73]:
df_all.head(2)

,bike_id,bike_type,duration,end_lat,end_lon,end_station,end_station_id,end_time,passholder_type,plan_duration,start_lat,start_lon,start_station,start_station_id,start_time,trip_id,trip_route_category
0,11908,standard,30,39.9478,-75.1941,3063.0,NaN,2018-10-01 00:33:00,Indego30,30,39.9478,-75.1941,3038.0,NaN,2018-10-01 00:03:00,299955254,One Way
1,5382,standard,7,39.9453,-75.1797,3064.0,NaN,2018-10-01 00:13:00,Indego30,30,39.9453,-75.1797,3032.0,NaN,2018-10-01 00:06:00,299955253,One Way

#### Solving bike_type problem

In [87]:
df_all.groupby('bike_type')[['bike_id']].nunique()

           bike_id
bike_type
electric        19
standard      2808

hmmm I thought they had a hell lot more bikes than this. Anyway, 3000 bikes for Philadelphia is within the reasonable range.

So we have a lot of missing data, which basically confims what we have seen previously. Is it possible that we can create a mapping dictionary to map bike_id to types for the whole dataframe?

In [83]:
print(
    'all unique bike_ids:', df_all.bike_id.nunique(), 
    'unique bike_ids with bike_type:', df_all[~df_all.bike_type.isna()].bike_id.nunique()
)

all unique bike_ids: 3588 unique bike_ids with bike_type: 2826

It is around 80%. Seems to be okay to fill data. Will fill undefined as 'missing'

In [133]:
df_bike_type = df_all[['bike_id', 'bike_type']].drop_duplicates()

In [134]:
df_bike_type.describe()

        bike_id bike_type
count      4776      2827
unique     3588         2
top        2557  standard
freq          2      2808

In [135]:
df_bike_type.head(2)

  bike_id bike_type
0   11908  standard
1    5382  standard

In [136]:
df_bike_type.groupby('bike_id').count().sort_values(by = 'bike_type', ascending=False).head(2)

         bike_type
bike_id
15067            2
02935            1

In [137]:
df_bike_type.drop('15067').groupby('bike_id').count().sort_values(by = 'bike_type', ascending=False).head(2)

         bike_type
bike_id
15067            2
02935            1

Make the mapping dataframe

In [132]:
# Rerunning this requires the reconstruction of df_bike_type
df_bike_type.set_index('bike_id', inplace=True)
df_bike_type.drop('15067', inplace=True)
df_bike_type[df_bike_type.index == '15067']

Empty DataFrame
Columns: [bike_type]
Index: []

In [148]:
df_all_bike_type_filled = pd.merge( df_all, df_bike_type, how='left', on='bike_id' )

In [153]:
df_all_bike_type_filled[df_all_bike_type_filled.bike_type_x != df_all_filled.bike_type_y].head(2)

,bike_id,bike_type_x,duration,end_lat,end_lon,end_station,end_station_id,end_time,passholder_type,plan_duration,start_lat,start_lon,start_station,start_station_id,start_time,trip_id,trip_route_category,bike_type_y
1,11908,standard,30,39.9478,-75.1941,3063.0,NaN,2018-10-01 00:33:00,Indego30,30,39.9478,-75.1941,3038.0,NaN,2018-10-01 00:03:00,299955254,One Way,NaN
3,5382,standard,7,39.9453,-75.1797,3064.0,NaN,2018-10-01 00:13:00,Indego30,30,39.9453,-75.1797,3032.0,NaN,2018-10-01 00:06:00,299955253,One Way,NaN

In [150]:
df_all_bike_type_filled[ ['bike_id', 'bike_type_x', 'bike_type_y'] ].describe()

        bike_id bike_type_x bike_type_y
count   4959697      794804     2459611
unique     3588           2           2
top        2679    standard    standard
freq       6412      790123     2455226

**Need more work on this. Have to move on. Though maybe important but let's talk about none electric first. None electric seems to be all standard bikes**

Indego introduced electric bikes in q3 of 2019. [Read in this blog post](https://www.rideindego.com/blog/indego-electric-is-back/). So it if safe to assume all bikes were standard bikes if it is not labelled as electric. **So we will fill in the NAs with standard for now.**

In [160]:
df_all['bike_type'] = df_all.bike_type.fillna('standard')

#### Do we have duplications of bike_ids?

In [152]:
# Check for duplications
df_all.groupby('trip_id')[['trip_id']].count().sort_values(by='trip_id', ascending=False).head(2)

           trip_id
trip_id
4001912          1
202630365        1

#### Understand passholder_type

The name of the passholderâ€™s plan

In [161]:
df_all.groupby('passholder_type').count()

,bike_id,bike_type,duration,end_lat,end_lon,end_station,end_station_id,end_time,plan_duration,start_lat,start_lon,start_station,start_station_id,start_time,trip_id,trip_route_category
passholder_type,,,,,,,,,,,,,,,,
Day Pass,89469,89469,89469,87855,87855,89469,0,89469,89469,89461,89461,89469,0,89469,89469,89469
Indego30,2070240,2070849,2070849,2059077,2059077,1115342,955507,2070849,2070849,2070698,2070698,1115342,955497,2070849,2070849,2070849
Indego365,125403,125403,125403,123816,123816,125403,0,125403,125403,125383,125383,125403,0,125403,125403,125403
IndegoFlex,28788,28820,28820,28671,28671,9472,19348,28820,28820,28819,28819,9472,19348,28820,28820,28820
One Day Pass,6767,6767,6767,6677,6677,6767,0,6767,6767,6757,6757,6767,0,6767,6767,6767
Two Day Pass,1603,1603,1603,1594,1594,1603,0,1603,1603,1603,1603,1603,0,1603,1603,1603
Walk-up,318906,319175,319175,317103,317103,101490,217685,319175,319175,319174,319174,101490,217685,319175,319175,319175

## Standard Bikes

In [162]:
df_standard = df_all[~(df_all.bike_type=='electric')]

In [163]:
df_standard.describe()

,duration,end_station,end_station_id,plan_duration,start_station,start_station_id,trip_id
count,2.637706e+06,1.445166e+06,1.192540e+06,2.637706e+06,1.445166e+06,1.192530e+06,2.637706e+06
mean,6.632455e+02,3.221959e+03,3.043533e+03,4.476082e+01,3.065481e+03,3.044298e+03,1.368817e+08
std,2.928227e+03,3.708118e+03,2.886743e+01,8.026433e+01,3.104622e+02,2.887558e+01,1.108039e+08
min,1.000000e+00,3.000000e+03,3.000000e+03,0.000000e+00,3.000000e+03,3.000000e+03,4.001912e+06
25%,1.100000e+01,3.025000e+03,3.022000e+03,3.000000e+01,3.026000e+03,3.022000e+03,4.810930e+06
50%,3.700000e+01,3.053000e+03,3.038000e+03,3.000000e+01,3.054000e+03,3.039000e+03,1.288614e+08
75%,6.600000e+02,3.099000e+03,3.061000e+03,3.000000e+01,3.100000e+03,3.061000e+03,2.426794e+08
max,8.640000e+04,9.025500e+04,3.129000e+03,3.650000e+02,9.001800e+04,3.129000e+03,3.133633e+08

In [164]:
df_standard.head()

,bike_id,bike_type,duration,end_lat,end_lon,end_station,end_station_id,end_time,passholder_type,plan_duration,start_lat,start_lon,start_station,start_station_id,start_time,trip_id,trip_route_category
0,11908,standard,30,39.9478,-75.1941,3063.0,NaN,2018-10-01 00:33:00,Indego30,30,39.9478,-75.1941,3038.0,NaN,2018-10-01 00:03:00,299955254,One Way
1,5382,standard,7,39.9453,-75.1797,3064.0,NaN,2018-10-01 00:13:00,Indego30,30,39.9453,-75.1797,3032.0,NaN,2018-10-01 00:06:00,299955253,One Way
2,11930,standard,6,39.9453,-75.1797,3064.0,NaN,2018-10-01 00:13:00,Indego30,30,39.9453,-75.1797,3032.0,NaN,2018-10-01 00:07:00,299955252,One Way
3,5225,standard,6,39.9372,-75.1612,3007.0,NaN,2018-10-01 00:20:00,Indego30,30,39.9372,-75.1612,3025.0,NaN,2018-10-01 00:14:00,299955251,One Way
4,3379,standard,6,39.9538,-75.1948,3035.0,NaN,2018-10-01 00:23:00,Indego30,30,39.9538,-75.1948,3029.0,NaN,2018-10-01 00:17:00,299955250,One Way

In [165]:
df_standard.to_csv('/tmp/tmp.csv', index=False)